configuration/Catalogs/_Карточки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>_Карточки</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидКарточки_Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВидыКарточки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидКарточки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef._ВидыКарточек</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

configuration/Enums/_ВариантыДвиженийДокумента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>_ВариантыДвиженийДокумента</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДатойДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТекущимВременем</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

configuration/Enums/_СпособыХранениеРеквизитовКарточки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>_СпособыХранениеРеквизитовКарточки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВКарточке</Name>
					<Comment>Означет, что значение хрнится в карточке, Иначе - это свойство другого реквизита</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

configuration/Documents/_ДвиженияКарточки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>_ДвиженияКарточки</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister._СостояниеКарточек</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Карточка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._Карточки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантДвиженийДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef._ВариантыДвиженийДокумента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Реквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Карточка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef._Карточки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРеквизита</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef._ВидыРеквизитов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УИД_Элемента</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеРеквизита</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic._ВидыРеквизитов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеАктивно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

configuration/Catalogs/_ВидыКарточек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>_ВидыКарточек</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Реквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидРеквизита</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef._ВидыРеквизитов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Хранение</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef._ВидыРеквизитов</v8:Type>
								<v8:Type>cfg:EnumRef._СпособыХранениеРеквизитовКарточки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРеквизитаВХранении</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef._ВидыРеквизитов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтартовоеДействие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef._Действия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтартовоеЗначениеРеквизита</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic._ВидыРеквизитов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоФункциональнаяРоль</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтображаемыеГруппыКоманд</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГруппыКоманд</Name>
							<Type>
								<v8:Type>cfg:CatalogRef._КомандыГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыКарточки_родители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидКарточки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef._ВидыКарточек</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

configuration/Catalogs/_Карточки/Ext/ObjectModule.bsl
Процедура ПриЗаписи(Отказ)
	Если Не ЭтотОбъект.ЭтоГруппа Тогда
		ДокументДвижения = Документы._ДвиженияКарточки.СоздатьДокумент();
		// Заполняем основные реквизиты документа
		ДокументДвижения.Дата = ТекущаяДатаСеанса();
		ДокументДвижения.Карточка = ЭтотОбъект.Ссылка;
		ДокументДвижения.ВариантДвиженийДокумента = Перечисления._ВариантыДвиженийДокумента.ТекущимВременем;

		ЭтотОбъект.ДополнительныеСвойства.Вставить("ДокументДвижения",ДокументДвижения);
		
		// Вызов процедуры инициализации, Если карточка стартована, то старт будет остановлен.
		СтартоватьКарточку();
		Если ЭтотОбъект.ДополнительныеСвойства.Свойство("СохраняемыеРеквизиты") Тогда
			СохранитьРеквизиты();
		КонецЕсли;


		// Проверяем, имеются ли строки в табличной части ДокументДвижения
		Если ДокументДвижения.Реквизиты.Количество() > 0 Тогда
			// Проводим документ
			ДокументДвижения.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура СтартоватьКарточку()
	
	// Проверяем, есть ли уже какие-либо движения для данной карточки в регистре _СостояниеКарточек
	// Если да - инициализация не требуется, выходим.
	Если ЗначениеЗаполнено(Документы._ДвиженияКарточки.НайтиПоРеквизиту("Карточка",ЭтотОбъект.Ссылка)) Тогда
		Возврат;
	КонецЕсли;
	
	// Дальнейший код выполняется, только если движений не было
	
	ДокументДвижения = ЭтотОбъект.ДополнительныеСвойства.ДокументДвижения;
	
	// Заполняем основные реквизиты документа
	ДокументДвижения.Дата = ТекущаяДатаСеанса();
	ДокументДвижения.Карточка = ЭтотОбъект.Ссылка;
	ДокументДвижения.ВариантДвиженийДокумента = Перечисления._ВариантыДвиженийДокумента.ТекущимВременем;
	ДокументДвижения.Комментарий = "Стартовое заполнение реквизитов";
	
	// Получаем табличную часть "Реквизиты" из шаблона вида карточки
	// Для этого прочитаем все реквизиты, связанные с данным ВидомКарточки
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыКарточекТабличнаяЧасть.ВидРеквизита,
		|	ВидыКарточекТабличнаяЧасть.СтартовоеЗначениеРеквизита,
		|	ВидыКарточекТабличнаяЧасть.СтартовоеДействие
		|ИЗ
		|	Справочник._ВидыКарточек.Реквизиты КАК ВидыКарточекТабличнаяЧасть
		|ГДЕ
		|	ВидыКарточекТабличнаяЧасть.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.ВидыКарточки[0].ВидКарточки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Перебираем строки табличной части вида карточки
	Пока Выборка.Следующий() Цикл
		
		// Проверяем, задано ли действие в шаблоне
		Если НЕ ЗначениеЗаполнено(Выборка.СтартовоеДействие) Тогда
			// Если действие не задано, пропускаем этот реквизит
			Продолжить;
		КонецЕсли;
		
		// Добавляем строку в табличную часть документа
		НоваяСтрока = ДокументДвижения.Реквизиты.Добавить();
		НоваяСтрока.ВидРеквизита = Выборка.ВидРеквизита;
		НоваяСтрока.Карточка = ЭтотОбъект.Ссылка;
		НоваяСтрока.УИД_Элемента = Выборка.ВидРеквизита;
		НоваяСтрока.ЗначениеАктивно = Истина;
		
		// Проверяем, какое действие указано в шаблоне
		// Сравниваем с предопределенными элементами справочника _Действия
		Если Выборка.СтартовоеДействие = Справочники._Действия.Установить Тогда
			// Устанавливаем значение из поля СтартовоеЗначениеРеквизита
			НоваяСтрока.ЗначениеРеквизита = Выборка.СтартовоеЗначениеРеквизита;
		ИначеЕсли Выборка.СтартовоеДействие = Справочники._Действия.ТекущаяДата Тогда
			// Устанавливаем значение как текущую дату сеанса
			НоваяСтрока.ЗначениеРеквизита = ТекущаяДатаСеанса();
		Иначе
			// возможно, это "НеИзменять" или другое, не требующее начального заполнения
			// В этом случае удалим только что добавленную строку
			ДокументДвижения.Реквизиты.Удалить(НоваяСтрока);
		КонецЕсли;
		
	КонецЦикла;
	
	
КонецПроцедуры 

Процедура СохранитьРеквизиты()
	
	ДокументДвижения = ЭтотОбъект.ДополнительныеСвойства.ДокументДвижения;

	// Перебираем строки таблицы СохраняемыеРеквизиты и сохраняю необходимые реквизиты
	Для Каждого Выборка Из ЭтотОбъект.ДополнительныеСвойства.СохраняемыеРеквизиты Цикл
		Если Выборка.Хранение <> Перечисления._СпособыХранениеРеквизитовКарточки.ВКарточке Тогда
			Продолжить; // сохранять нужно только те реквизиты, которые хранятся в карточке
		КонецЕсли;
		
		//Вычислияю значение УИД_Элемента, для новых строк (где УИД_Элемента не указан) создаю новое значение)
		//Если НЕ Выборка.ВидРеквизита.ЭтоСписок ИЛИ ЗначениеЗаполнено(Выборка.УИД_Элемента) Тогда 
			УИД_Элемента = Выборка.УИД_Элемента;
		//Иначе
		//	УИД_Элемента = Новый УникальныйИдентификатор();
		//КонецЕсли;
		
		//Удаляю строки добавленные при старте, т.к. считаю, что старотовые значения менее приоритетны чем установленные вручную.
		ОтборПоискаУжеДобавленныхСтрок = Новый Структура("ВидРеквизита,УИД_Элемента",Выборка.ВидРеквизита,УИД_Элемента);
		НайденныеСтроки = ДокументДвижения.Реквизиты.НайтиСтроки(ОтборПоискаУжеДобавленныхСтрок);
		Для Каждого НайденнаяСтрока из НайденныеСтроки Цикл
			ДокументДвижения.Реквизиты.Удалить(НайденнаяСтрока);
		КонецЦикла;
		
		// Добавляю строку со значением в табличную часть ДокументДвижения
		НоваяСтрока = ДокументДвижения.Реквизиты.Добавить();
		НоваяСтрока.Карточка = ЭтотОбъект.Ссылка;
		НоваяСтрока.ВидРеквизита = Выборка.ВидРеквизита;
		НоваяСтрока.ЗначениеРеквизита = Выборка.ЗначениеРеквизита;
		Если НоваяСтрока.ВидРеквизита.ЭтоСписок Тогда
			НоваяСтрока.УИД_Элемента = УИД_Элемента;
		КонецЕсли;
		НоваяСтрока.ЗначениеАктивно = Выборка.ЗначениеАктивно;
	КонецЦикла;
	
КонецПроцедуры 

Процедура ПередЗаписью(Отказ)
	Если НЕ ЭтотОбъект.ЭтоГруппа Тогда
		НачалоСтроки = "?";
		Разделитель="; ";
		ПредставлениВидаКрточки = НачалоСтроки;
		Для Каждого стрВидКарточки Из ЭтотОбъект.ВидыКарточки Цикл
			 ПредставлениВидаКарточки = ПредставлениВидаКрточки + Разделитель + СокрЛП(стрВидКарточки.ВидКарточки.Наименование);
		КонецЦикла;
		ПредставлениВидаКарточки = СтрЗаменить(ПредставлениВидаКарточки,НачалоСтроки+Разделитель,"");

		ЭтотОбъект.ВидКарточки_Представление =ПредставлениВидаКарточки;
	КонецЕсли;
КонецПроцедуры
